CREATE DATABASE cashflow;

USE cashflow;

CREATE TABLE accounts_info (
    id BIGINT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    account_id CHAR(20) NOT NULL,
    bank_name CHAR(20) NOT NULL,
    account_number CHAR(20) NOT NULL,
    account_holder CHAR(20) NOT NULL,
    account_type CHAR(20) NOT NULL,
    branch_name CHAR(20),
    account_alias CHAR(20),
    description VARCHAR(255),
    opening_date DATE,
    closing_date DATE,
    created_at DATETIME NOT NULL DEFAULT NOW(),
    deleted_at DATETIME
);

CREATE TABLE cashflow_tbl (
    id BIGINT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    account_id CHAR(20) NOT NULL,
    dw_date DATE NOT NULL,
    category CHAR(20) NOT NULL,
    client CHAR(20) NOT NULL,
    deposit BIGINT UNSIGNED NOT NULL DEFAULT 0,
    withdrawal BIGINT UNSIGNED NOT NULL DEFAULT 0,
    description VARCHAR(255),
    created_at DATETIME NOT NULL DEFAULT NOW(),
    deleted_at DATETIME
);

INSERT INTO accounts_info (account_id, bank_name, account_number, account_holder, account_type, branch_name, account_alias, description, opening_date) VALUES
('hana1234', '하나은행', '12345-01-1234', 'FC호텔', '보통예금', '여의도점', '매출계좌', '매출대금 입금계좌', '2024-01-02'),
('hana4321', '하나은행', '12345-01-4321', 'FC호텔', '보통예금', '여의도점', '운영계좌', '운영비용 지출 계좌', '2024-01-02'),
('shhn4567', '신한은행', '54321-21-4567', 'FC호텔', '정기예금', '여의도점', '정기예금', '10억원 1년 정기예금', '2024-01-02');

INSERT INTO cashflow_tbl (account_id, dw_date, category, client, deposit, withdrawal, description) VALUES
('hana4321', '2024-01-02', '자본금', 'FC사', 2000000000, 0, '자본금 입금'),
('hana4321', '2024-01-02', '계좌이체', 'FC사', 0, 1000000000, '정기예금 예치'),
('shhn4567', '2024-01-02', '계좌이체', 'FC사', 1000000000, 0, '정기예금 예치'),
('hana1234', '2024-01-03', '객실수입', '호텔스닷컴', 33000000, 0, '객실 매출'),
('hana4321', '2024-01-03', '고객용품비', 'ABC용품사', 0, 20000000, '고객용품비 지출'),
('hana4321', '2024-01-03', '기타영업비용', 'A사', 0, 15000000, '영업비용A'),
('hana1234', '2024-01-04', '객실수입', '호텔스넷', 25000000, 0, '객실 매출'),
('hana1234', '2024-01-05', '객실수입', '호텔스닷컴', 30000000, 0, '객실 매출'),
('hana1234', '2024-01-06', '객실수입', '호텔스넷', 25000000, 0, '객실 매출'),
('hana1234', '2024-01-07', '객실수입', '호텔스닷컴', 31000000, 0, '객실 매출'),
('hana4321', '2024-01-07', '판매수수료', '호텔스닷컴', 0, 4700000, '객실판매수수료'),
('hana1234', '2024-01-08', '객실수입', '호텔스넷', 25000000, 0, '객실 매출'),
('hana4321', '2024-01-08', '판매수수료', '호텔스넷', 0, 3750000, '객실판매수수료'),
('hana1234', '2024-01-09', '객실수입', '호텔스닷컴', 31000000, 0, '객실 매출'),
('hana1234', '2024-01-10', '객실수입', '호텔스넷', 27000000, 0, '객실 매출'),
('hana4321', '2024-01-10', '고객용품비', 'ABC용품사', 0, 15000000, '고객용품비 지출'),
('hana4321', '2024-01-10', '세금과공과', '세금과공과', 0, 85000000, '세금과공과'),
('hana4321', '2024-01-10', '기타영업비용', 'B사', 0, 20000000, '영업비용B');

INSERT INTO cashflow_tbl (account_id, dw_date, category, client, deposit, withdrawal, description) VALUES
('hana1234', '2024-01-11', '객실수입', '호텔스닷컴', 25000000, 0, '객실 매출'),
('hana1234', '2024-01-12', '객실수입', '호텔스넷', 32000000, 0, '객실 매출'),
('hana1234', '2024-01-13', '객실수입', '호텔스닷컴', 35000000, 0, '객실 매출'),
('hana4321', '2024-01-13', '판매수수료', '호텔스닷컴', 0, 4550000, '객실판매수수료'),
('hana1234', '2024-01-14', '객실수입', '호텔스넷', 33000000, 0, '객실 매출'),
('hana4321', '2024-01-14', '판매수수료', '호텔스넷', 0, 4600000, '객실판매수수료'),
('hana1234', '2024-01-15', '객실수입', '호텔스닷컴', 24000000, 0, '객실 매출'),
('hana1234', '2024-01-16', '객실수입', '호텔스넷', 22000000, 0, '객실 매출'),
('hana1234', '2024-01-17', '객실수입', '호텔스닷컴', 25000000, 0, '객실 매출'),
('hana4321', '2024-01-17', '고객용품비', 'ABC용품사', 0, 20000000, '고객용품비 지출'),
('hana4321', '2024-01-17', '기타영업비용', 'A사', 0, 18000000, '영업비용C'),
('hana1234', '2024-01-18', '객실수입', '호텔스넷', 28000000, 0, '객실 매출'),
('hana1234', '2024-01-19', '객실수입', '호텔스닷컴', 25000000, 0, '객실 매출'),
('hana4321', '2024-01-19', '판매수수료', '호텔스닷컴', 0, 3700000, '객실판매수수료'),
('hana4321', '2024-01-19', '수도광열비', '수도광열비', 0, 41000000, '수도광열비 등'),
('hana1234', '2024-01-20', '객실수입', '호텔스넷', 27000000, 0, '객실 매출'),
('hana4321', '2024-01-20', '판매수수료', '호텔스넷', 0, 3850000, '객실판매수수료');

INSERT INTO cashflow_tbl (account_id, dw_date, category, client, deposit, withdrawal, description) VALUES
('hana1234', '2024-01-21', '객실수입', '호텔스닷컴', 29000000, 0, '객실 매출'),
('hana4321', '2024-01-21', '급여', '종업원급여', 0, 170000000, '종업원급여'),
('hana1234', '2024-01-22', '객실수입', '호텔스넷', 28000000, 0, '객실 매출'),
('hana1234', '2024-01-23', '객실수입', '호텔스닷컴', 31000000, 0, '객실 매출'),
('hana1234', '2024-01-24', '객실수입', '호텔스넷', 25000000, 0, '객실 매출'),
('hana4321', '2024-01-24', '고객용품비', 'ABC용품사', 0, 15000000, '고객용품비 지출'),
('hana4321', '2024-01-24', '노무용역비', '노무용역사', 0, 170000000, '노무용역비'),
('hana4321', '2024-01-24', '기타영업비용', 'C사', 0, 15000000, '영업비용D'),
('hana1234', '2024-01-25', '객실수입', '호텔스닷컴', 30000000, 0, '객실 매출'),
('hana4321', '2024-01-25', '판매수수료', '호텔스닷컴', 0, 4500000, '객실판매수수료'),
('hana1234', '2024-01-26', '객실수입', '호텔스넷', 31000000, 0, '객실 매출'),
('hana4321', '2024-01-26', '판매수수료', '호텔스넷', 0, 4200000, '객실판매수수료'),
('hana1234', '2024-01-27', '객실수입', '호텔스닷컴', 25000000, 0, '객실 매출'),
('hana1234', '2024-01-28', '객실수입', '호텔스넷', 30000000, 0, '객실 매출'),
('hana1234', '2024-01-29', '객실수입', '호텔스닷컴', 32000000, 0, '객실 매출'),
('hana1234', '2024-01-30', '객실수입', '호텔스넷', 27000000, 0, '객실 매출'),
('hana4321', '2024-01-30', '판매수수료', '호텔스넷', 0, 2850000, '객실판매수수료'),
('hana1234', '2024-01-31', '객실수입', '호텔스닷컴', 32000000, 0, '객실 매출'),
('hana4321', '2024-01-31', '판매수수료', '호텔스닷컴', 0, 4450000, '객실판매수수료'),
('hana4321', '2024-01-31', '고객용품비', 'ABC용품사', 0, 15000000, '고객용품비 지출'),
('hana4321', '2024-01-31', '기타영업비용', 'C사', 0, 20000000, '영업비용E');


